juniorbassani/floripasat-obdh-msp430fr5969/hw_memmap.h
///* --COPYRIGHT--,BSD
 //* Copyright (c) 2016, Texas Instruments Incorporated
 //* All rights reserved.
 //*
 //* Redistribution and use in source and binary forms, with or without
 //* modification, are permitted provided that the following conditions
 //* are met:
 //*
 //* *  Redistributions of source code must retain the above copyright
 //*    notice, this list of conditions and the following disclaimer.
 //*
 //* *  Redistributions in binary form must reproduce the above copyright
 //*    notice, this list of conditions and the following disclaimer in the
 //*    documentation and/or other materials provided with the distribution.
 //*
 //* *  Neither the name of Texas Instruments Incorporated nor the names of
 //*    its contributors may be used to endorse or promote products derived
 //*    from this software without specific prior written permission.
 //*
 //* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 //* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 //* THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 //* PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 //* CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 //* EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 //* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 //* OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 //* WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 //* OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 //* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 //* --/COPYRIGHT--*/
//#ifndef __HW_MEMMAP__
//#define __HW_MEMMAP__
//
//#define __DRIVERLIB_MSP430F5XX_6XX_FAMILY__
////*****************************************************************************
////
//// Include device specific header file
////
////*****************************************************************************
//#include <msp430.h>
//
//#include "msp430f5xx_6xxgeneric.h"
//
//#include "stdint.h"
//#include "stdbool.h"
//
////*****************************************************************************
////
//// SUCCESS and FAILURE for API return value
////
////*****************************************************************************
//#define STATUS_SUCCESS  0x01
//#define STATUS_FAIL     0x00
//
////*****************************************************************************
////
//// Macro for enabling assert statements for debugging
////
////*****************************************************************************
//#define NDEBUG
//
////*****************************************************************************
////
//// Macros for hardware access
////
////*****************************************************************************
//#define HWREG32(x)                                                              \
    //(*((volatile uint32_t *)((uint16_t)x)))
//#define HWREG16(x)                                                             \
    //(*((volatile uint16_t *)((uint16_t)x)))
//#define HWREG8(x)                                                             \
    //(*((volatile uint8_t *)((uint16_t)x)))
//
//#endif // #ifndef __HW_MEMMAP__
